---
kind: property
id: P:Autodesk.Revit.DB.Electrical.InsulationTypeSet.IsEmpty
source: html/1136fff1-b554-15f2-b891-02c64e9db654.htm
---
# Autodesk.Revit.DB.Electrical.InsulationTypeSet.IsEmpty Property

Test to see if the set is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the set is empty then True will be returned, otherwise False.